#include "includes.h"

Skins g_skins{};;


#define MAX_WEAPONS	48

class CAttribute_String
{
public:
	virtual ~CAttribute_String();

	int32_t FieldSet;
	char** Value;

private:
	int32_t pad0[2];
};

struct cmd_context_t {
	bool		m_needs_processing{ };
	CUserCmd	m_user_cmd{ };
	int			m_cmd_number{ };
};

template < typename Key, typename Value >
struct Node_t {
	int previous_id;    //0x0000
	int next_id;        //0x0004
	void* _unknown_ptr; //0x0008
	int _unknown;       //0x000C
	Key key;            //0x0010
	Value value;        //0x0014
};

template < typename Key, typename Value >
struct Head_t {
	Node_t< Key, Value >* memory; //0x0000
	int allocation_count;         //0x0004
	int grow_size;                //0x0008
	int start_element;            //0x000C
	int next_available;           //0x0010
	int _unknown;                 //0x0014
	int last_element;             //0x0018
};

union attribute_data_union_t
{
	bool bValue;
	int iValue;
	float fValue;
	vec3_t* vValue;
	CAttribute_String* szValue;
};

class CEconItemAttributeDefinition;
class ISchemaAttributeType
{
public:
	virtual ~ISchemaAttributeType();
	virtual int GetTypeUniqueIdentifier();
	virtual void LoadEconAttributeValue();
	virtual void ConvertEconAttributeValueToByteStream();
	virtual bool BConvertStringToEconAttributeValue(const CEconItemAttributeDefinition*, const char*, attribute_data_union_t*);
};

struct attr_type_t
{
	char* name;
	ISchemaAttributeType* type;
};

struct AlternateIconData_t
{
private:
	int32_t pad0;

public:
	CUtlString icon_path;
	CUtlString icon_path_large;

private:
	CUtlString pad1[2];
};

struct kill_eater_score_type_t
{
	int id;
	char* type_name;
	char* model_attribute;
	char* level_data;
	bool use_level_data;
};

class CEconItemRarityDefinition
{
public:
	int value;
	int color;
	CUtlString name;
	CUtlString loc_key;
